title: DNS Queries to Known RMM Domains
id: 9fa68c28-79b2-4ab5-af95-0c7b2f706c63
status: experimental
description: Detects DNS queries to known Remote Monitoring and Management (RMM) tool
  domains that could indicate unauthorized remote access
references:
- https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: '2025-03-18'
modified: '2025-03-20'
tags:
- attack.command-and-control
- attack.t1219
logsource:
  category: dns
  product: any
detection:
  selection:
    query|contains:
    - .helpme.net
    - .*.islonline.com
    - .tanium.com/products/tanium-deploy
    - .datto.com/au/products/rmm/
    - .*systemmonitor.co.uk
    - .*.cmdm.comodo.com
    - .deploy01.kaseya.com
    - .ammyy.com
    - .kickidler.com
    - .pulseway.com
    - .client.teamviewer.com
    - .cognito-idp.us-west-2.amazonaws.com
    - .*.xeox.com
    - .*.opti-tune.com
    - .*cloudbackup.management
    - .live.screenconnect.com
    - .sunlogin.oray.com
    - .*.screenmeet.com
    - .changes.panorama9.com
    - .*.sorillus.com
    - .*.remotedesktop.com
    - .charon.netreo.net
    - .*.sophosupd.net
    - .content.rview.com
    - .naverisk.com
    - .syncromsp.com
    - .*.connectwise.com
    - .parallels.com/products/ras/try
    - .*.tailscale.io
    - .remotedesktop.google.com
    - .showmypc.com
    - .rudesktop.ru
    - .*.server-eye.de
    - .*system-monitor.com
    - .*.bluetrait.io
    - .*.logmein.eu
    - .*.rmm.datto.com
    - .*.desktopstreaming.com
    - .*.beyondtrustcloud.com
    - .intelliadmin.com/remote-control
    - .myivo-server.software.informer.com
    - .tailscale.com
    - .router15.teamviewer.com
    - .*.mdt.qq.com
    - .pubsub.atera.com
    - .skyfex.com
    - .ocsinventory-ng.org
    - .remotecall.com
    - .getscreen.me
    - .meshcentral.com
    - .*.desktop.qq.com
    - .crossloop.en.softonic.com
    - .upload_data.qq.com
    - .*.mspbackups.com
    - .*.zoho.com.cn
    - .*.netop.com
    - .beamyourscreen.com
    - .*set.me
    - .helpu.co.kr
    - .*.gotoassist.com
    - .*.devtunnels.ms
    - .anyplace-control.com
    - .*cell-1.domotz.com
    - .desktopcentral.manageengine.cn
    - .*.real-time-collaboration.com
    - .systemmonitor.us
    - .manageengine.com/remote-monitoring-management/
    - .encapto.com
    - .system-monitor.com
    - .weezo.en.softonic.com
    - .online.level.io
    - .electric.ai
    - .download.pilixo.com
    - .*.zohoassist.com
    - .senso.cloud
    - .*.247ithelp.com
    - .supremocontrol.com
    - .plus*.site24x7.com
    - .*.kabutoservices.com
    - .attachments.servably.com
    - .*.zoho.eu
    - .*.assist.jumpcloud.com
    - .*.action1.com
    - .le.laplink.com
    - .*.dms.zoho.com
    - .*.optitune.us
    - .*.kace.com
    - .community.sophos.com/on-premise-endpoint/f/sophos-endpoint-software/5725/sophos-remote-management-system
    - .sorillus.com
    - .*.beanywhere.com
    - .litemanager.com
    - .downloads.zohocdn.com
    - .*.beamyourscreen.com
    - .*remotedesktop.google.com
    - .cloudflare.com/products/tunnel/
    - .*.khelpdesk.com.br
    - .*.mikogo.com
    - .*mygreenpc.com
    - .pilixo.com
    - .level.io
    - .*.litemanager.com
    - .*.teamviewer.com
    - .logmein-gateway.com
    - .donkz.nl
    - .*.showmypc.com
    - .systemmonitor.eu.com
    - .crosstecsoftware.com/remotecontrol
    - .mikogo.com
    - .*.cloudberrylab.com
    - .*.weezo.me
    - .*.ivanti.com
    - .gw.remotix.com
    - .*server.absolute.com
    - .emcosoftware.com
    - .*.teknopars.com
    - .todesk.com
    - .one.comodo.com
    - .*.kabuto.io
    - .desktopcentral.manageengine.com
    - .nomachine.com
    - .*.adobeconnect.com
    - .*.beinsync.com
    - .*remote.management
    - .*.hostedrmm.com
    - .remoteutilities.com
    - .github.com/Mikej81/WebRDP
    - .github.com/V-E-O/rdp2tcp
    - .atera.pubnubapi.com
    - .remote.management
    - .*mdmsupport.comodo.com
    - .basecamp.com
    - .*.spytech-web.com
    - .remotepc.com
    - .ld.aurelius.host
    - .fortra.com
    - .panorama9.com
    - .builds.level.io
    - .ps.atera.com
    - .*.splashtop.com
    - .*.anyviewer.com
    - .*.rview.com
    - .connectwise.com
    - .imperosoftware.com
    - .*.itsupport247.net
    - .ninjaone.com
    - .asapi*.aweray.net
    - .*.deskroll.com
    - .*.cloud.tanium.com
    - .logmeinrescue.com
    - .qq-messenger.en.softonic.com
    - .*.logmeinrescue.com
    - .*.getscreen.me
    - .*.fastsupport.com
    - .rmansys.ru
    - .servicedesk.itarian.com
    - .plus*.site24x7.eu
    - .*.domotz.co
    - .jumpto.me
    - .*search.namequery.com
    - .ultravnc.com
    - .remobo.en.softonic.com
    - .ivanti.com/
    - .grtmprod.addigy.com
    - .*.instanthousecall.net
    - .*.01com.com
    - .todesktop.com
    - .msp360.com
    - .agents.level.io
    - .136.243.18.122
    - .packagesstore.blob.core.windows.net
    - .*.parallels.com
    - .*.sophosupd.com
    - .*.rudesktop.ru
    - .spyanywhere.com
    - .kaseya.com
    - .beanywhere.com
    - .*.beinsync.net
    - .remotepass.com
    - .splashtop.com
    - .*.fleetdeck.io
    - .fleetdeck.io
    - .docs.tacticalrmm.com
    - .*systemmonitor.eu.com
    - .*.weezo.net
    - .resources.ninjarmm.com
    - .*.zoho.in
    - .*signalserver.xyz
    - .*.iperius-rs.com
    - .a1-backend-packages.s3.amazonaws.com
    - .*.zoho.com
    - .51.255.19.178
    - .au.pcmag.com/utilities/21470/webex-pcnow
    - .*.gatherplace.com
    - .*.todesk.com
    - .cfcdn.pdq.com
    - .gateway.zohoassist.com
    - .tele-desk.com
    - .*.anydesk.com
    - .rmm.barracudamsp.com
    - .01com.com/imintouch-remote-pc-desktop
    - .repairshopr.com
    - .taf.teamviewer.com
    - .jumpdesktop.com
    - .*.api.splashtop.com
    - .systemmonitor.co.uk
    - .*.litemanager.ru
    - .*.gotoassist.at
    - .pubsub.pubnub.com
    - .helpbeam.software.informer.com
    - .neturo.uplus.co.kr
    - .*.endpoint.ingress.rapid7.com
    - .*remotedesktop-pa.googleapis.com
    - .*.aomeisoftware.com
    - .plus*.site24x7.in
    - .logicnow.com
    - .goverlan.com
    - .portal.ehorus.com
    - .*.api.jumpcloud.com
    - .*.level.io
    - .tightvnc.com
    - .*.jumpto.me
    - .*.jumpdesktop.com
    - .*.iperiusremote.com
    - .cacerts.thawte.com
    - .*.startsupport.com
    - .*.getgo.com
    - .plus*.site24x7.net.au
    - .ericom.com
    - .activation.netreo.net
    - .*.screenconnect.com
    - .xeox.com
    - .wen.laplink.com/product/laplink-gold
    - .*.zohoassist.com.cn
    - .atled.syspectr.com
    - .cloudbackup.management
    - .guacamole.apache.org
    - .*.n-able.com
    - .*.alpemix.com
    - .*systemmonitor.us
    - .acceo.com/turbomeeting/
    - .*.ninjarmm.com
    - .*.nate.com
    - .*.msp360.com
    - .remote.it
    - .*.relay.splashtop.com
    - .control.connectwise.com
    - .agent-api.atera.com
    - .desktopcentral.manageengine.com.eu
    - .relay-[a-f0-9]{8}.net.anydesk.com:443
    - .iperiusremote.com
    - .eset.com/me/business/remote-management/remote-administrator/
    - .136.243.104.242
    - .api.remote.it
    - .kabutoservices.com
    - .*.api.splashtop.eu
    - .*.remotepc.com
    - .*setme.net
    - .islonline.com
    - .*.rel.tunnels.api.visualstudio.com
    - .radmin.com
    - .*.distantdesktop.com
    - .weezo.net
    - .fixme.it
    - .*.islonline.net
    - .*.senso.cloud
    - .*.analytics.insight.rapid7.com
    - .zoho.com/assist/
    - .*.superops.ai
    - .*.supremocontrol.com
    - .*.ivanticloud.com
    - .goto.com
    - .appcdn.atera.com
    - .agenthb.atera.com
    - .repairtechsolutions.com/kabuto/
    - .auvik.com
    - .systemmanager.ru/dntu.en/rdp_view.htm
    - .app.syspectr.com
    - .everywhere.laplink.com
    - .51.255.19.179
    - .ps.pndsn.com
    - .*.fastviewer.com
    - .www.remotepc.com
    - .*.nchuser.com
    - .zabbix.com
    - .itsupport247.net
    - .instanthousecall.com
    - .ultraviewer.net
    - .deskroll.com
    - .plus*.site24x7.cn
    - .barracudamsp.com
    - .client-api.aweray.com
    - .*.logmeinrescue.eu
    - .gatherplace.com
    - .*.syncroapi.com
    - .GetScreen.me
    - .*.helpu.co.kr
    - .downloads.io
    - .zerotier.com
    - .boot.net.anydesk.com
    - .*.instanthousecall.com
    - .app.kabuto.io
    - .connect.acronis.com
    - .site24x7.com/msp
    - .*.logmein.com
    - .*.anysupport.net
    - .serv.superopsalpha.com
    - .n-able.com
    - .netreo.com
    - .learn.microsoft.com/en-us/azure/developer/dev-tunnels/overview
    - .*.logicnow.com
    - .*.itsm-us1.comodo.com
    - .*.dwservice.net
    - .agentreporting.atera.com
    - .ivanti.com
    - .*.zohoassist.jp
    - .cloud.tanium.com
    - .download.cnet.com/Net-Viewer/3000-2370_4-10034828.html
    - .rustdesk.com
    - .servably.com
    - .*.techinline.net
    - .aeroadmin.com
    - .agents.addigy.com
    - .assist.zoho.com
    - .*.gatherplace.net
    - .runsmart.io
    - .*soti.net
    - .getalphacontrol.com
    - .netsupportmanager.com
    - .ezhelp.co.kr
    - .*.crossloop.com
    - .login.tailscale.com
    - .*.-dms.zoho.com.cn
    - .app.deskday.ai
    - .systemmonitor.us.cdn.cloudflare.net
    - .secure.instanthousecall.com
    - .downloads.zohodl.com.cn
    - .*.connect.backdrop.cloud
    - .superops.ai
    - .remoteaccess.itarian.com
    - .*.kaseya.net
    - .beanywhere.en.uptodown.com/windows
    - .*.pilixo.com
    - .centuriontech.com
    - .app.atera.com
    - .seetrol.co.kr
    - .*.netsupportmanager.com
    - .prod.addigy.com
    - .dameware.com
    - .*.logmeininc.com
    - .*.ntrsupport.com
    - .*.gotohttp.com
    - .*.GoToMyPC.com
    - .*.tailscale.com
    - .*.ninjaone.com
    - .*.scrn.mt
    - .*.bomgarcloud.com
    - .*ammyy.com
    - .bomgarcloud.com
    - .*.remotecall.com
    - .auth*.aeroadmin.com
    - .*.mikogo4.com
    - .agents*-cloud.acronis.com
    - .github.com/stascorp/rdpwrap
    - .web.rustdesk.com
    - .ehorus.com
    - .* .nanosystems.it
    - .cloud.acronis.com
    - .domotz.com
    - .wangwang.taobao.com
    - .mremoteng.org
    - .*content.rview.com
    - .*.superopsalpha.com
    - .* .ultraviewer.net
    - .ngrok.com
    - .*.dms.zoho.com.eu
    - .*.fixme.it
    - .deskday.ai
    - .global.rel.tunnels.api.visualstudio.com
    - .www.quest.com/kace/
    - .agentreportingstore.blob.core.windows.net
    - .*.api.netreo.com
    - .*.internetid.ru
    - .rport.io
    - .*.zerotier.com
    - .*.swi-tc.com
    - .soti.net/products/soti-pocket-controller
    - .*cc.centrastage.net
    - .auth.api.remote.it
    - .*.support.services.microsoft.com
    - .imperosoftware.com/impero-connect/
    - .client.oray.net
    - .*.superopsbeta.com
    - .royalapps.com
    - .bluetrait.io
    - .gotohttp.com
    - .mdmsupport.comodo.com
    - .136.243.104.235
    - .trusted.panorama9.com
    - .kabuto.io
    - .fastviewer.com
    - .*.pcvisit.de
    - .realvnc.com/en/connect/download/vnc
    - .*.intelliadmin.com
    - .simple-help.com
    - .*.my.auvik.com
    - .*managedsupport.kaseya.net
    - .*.ezhelp.co.kr
    - .geo.netsupportsoftware.com
    - .*.syncromsp.com
    - .*.iperius.com
    - .pcvisit.de
    - .*.gotoassist.me
    - .app.pdq.com
    - .*.auvik.com
    - .atera-agent-heartbeat.servicebus.windows.net
    - .*.sophos.com
    - .my.kickidler.com
    - .*.zoho.com.au
  filter:
    query|contains: your-approved-rmm.com
  condition: selection and not filter
falsepositives:
- Legitimate usage of approved remote management tools
level: medium
