title: Potential Acronis Cyber Protect (Remotix) RMM Tool Process Activity
id: 1c52dfd5-39b5-4891-86be-b20a5dd5443d
status: experimental
description: |
    Detects potential processes activity of Acronis Cyber Protect (Remotix) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - AcronisCyberProtectConnectQuickAssist*.exe
            - AcronisCyberProtectConnectAgent.exe
    selection_image:
        Image|endswith:
            - AcronisCyberProtectConnectQuickAssist*.exe
            - AcronisCyberProtectConnectAgent.exe
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Acronis Cyber Protect (Remotix)
level: medium
