title: Potential Action1 RMM Tool File Activity
id: 0e4ac9ba-0f84-4437-b952-3a5ff816eef3
status: experimental
description: |
    Detects potential files activity of Action1 RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - C:\Windows\Action1\action1_agent.exe
            - C:\Windows\Action1\*
            - C:\Windows\Action1\scripts\*
            - C:\Windows\Action1\rule_data\*
            - C:\Windows\Action1\action1_log_*.log
    condition: selection
falsepositives:
    - Legitimate use of Action1
level: medium
