title: Potential Alpemix RMM Tool File Activity
id: 48635891-4740-4323-9654-0c950f7129a0
status: experimental
description: |
    Detects potential files activity of Alpemix RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: %localappdata%\Alpemix\Alpemix.ini
    condition: selection
falsepositives:
    - Legitimate use of Alpemix
level: medium
