title: Potential Ammyy Admin RMM Tool Registry Activity
id: b467222e-2511-4dc8-b7f2-6512e51f010f
status: experimental
description: |
    Detects potential registry activity of Ammyy Admin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - HKU\.DEFAULT\Software\Ammyy\Admin
            - HKLM\SYSTEM\ControlSet001\Control\SafeBoot\Network\AmmyyAdmin
    condition: selection
falsepositives:
    - Legitimate use of Ammyy Admin
level: medium
