title: Potential Ammyy Admin RMM Tool File Activity
id: f888a292-f924-4ec6-89f0-e1d645380537
status: experimental
description: |
    Detects potential files activity of Ammyy Admin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - %programdata%\\AMMYY\\access.log
            - %Binary_path%\\AA_v3.log
    condition: selection
falsepositives:
    - Legitimate use of Ammyy Admin
level: medium
