title: Potential AnyDesk RMM Tool Registry Activity
id: 3313d179-78b1-41d3-afe0-40dfc5dc794f
status: experimental
description: |
    Detects potential registry activity of AnyDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - HKLM\SOFTWARE\Clients\Media\AnyDesk
            - HKLM\SYSTEM\CurrentControlSet\Services\AnyDesk
            - HKLM\SOFTWARE\Classes\.anydesk\shell\open\command
            - HKLM\SOFTWARE\Classes\AnyDesk\shell\open\command
            - HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Print\Printers\AnyDesk Printer\*
            - HKLM\DRIVERS\DriverDatabase\DeviceIds\USBPRINT\AnyDesk
            - HKLM\DRIVERS\DriverDatabase\DeviceIds\WSDPRINT\AnyDesk
            - HKLM\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Uninstall\AnyDesk
    condition: selection
falsepositives:
    - Legitimate use of AnyDesk
level: medium
