title: Potential AnyDesk RMM Tool File Activity
id: 57cb129e-6cd6-42e9-8b5d-04542121fd79
status: experimental
description: |
    Detects potential files activity of AnyDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - %programdata%\AnyDesk\ad_svc.trace
            - %programdata%\AnyDesk\connection_trace.txt
            - %APPDATA%\AnyDesk\connection_trace.txt
            - %APPDATA%\AnyDesk\ad.trace
            - %APPDATA%\AnyDesk\chat\*.txt
            - %APPDATA%\AnyDesk\user.conf
            - %PROGRAMDATA%\AnyDesk\service.conf
            - %APPDATA%\AnyDesk\service.conf
            - %APPDATA%\AnyDesk\system.conf
            - %PROGRAMDATA%\AnyDesk\system.conf
            - %PROGRAMDATA%\Microsoft\Windows\Start Menu\Programs\StartUp\AnyDesk.lnk
            - %PROGRAMDATA%\Microsoft\Windows\Start Menu\Programs\AnyDesk\Uninstall AnyDesk.lnk
            - C:\Users\*\Videos\AnyDesk\*.anydesk
            - C:\Windows\SysWOW64\config\systemprofile\AppData\Roaming\AnyDesk\*
            - ~/Library/Application Support/AnyDesk/Logs/
            - ~/.config/AnyDesk/Logs/
    condition: selection
falsepositives:
    - Legitimate use of AnyDesk
level: medium
