title: Potential AnyDesk RMM Tool File Activity
id: 44367621-23b7-59dc-ab1a-c20ffafff741
status: experimental
description: |
    Detects potential files activity of AnyDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - '%programdata%\AnyDesk\ad_svc.trace'
            - '%programdata%\AnyDesk\connection_trace.txt'
            - '%APPDATA%\AnyDesk\connection_trace.txt'
            - '%APPDATA%\AnyDesk\ad.trace'
            - '%APPDATA%\AnyDesk\chat\*.txt'
            - '%APPDATA%\AnyDesk\user.conf'
            - '%PROGRAMDATA%\AnyDesk\service.conf'
            - '%APPDATA%\AnyDesk\service.conf'
            - '%APPDATA%\AnyDesk\system.conf'
            - '%PROGRAMDATA%\AnyDesk\system.conf'
            - '%PROGRAMDATA%\Microsoft\Windows\Start Menu\Programs\StartUp\AnyDesk.lnk'
            - '%PROGRAMDATA%\Microsoft\Windows\Start Menu\Programs\AnyDesk\Uninstall AnyDesk.lnk'
            - 'C:\Users\*\Videos\AnyDesk\*.anydesk'
            - 'C:\Windows\SysWOW64\config\systemprofile\AppData\Roaming\AnyDesk\*'
            - '~/Library/Application Support/AnyDesk/Logs/'
            - '~/.config/AnyDesk/Logs/'
    condition: selection
falsepositives:
    - Legitimate use of AnyDesk
level: medium
