title: Potential AnyDesk RMM Tool Registry Activity
id: 8ec90487-32c3-5776-91ae-4b2effe2ad25
status: experimental
description: |
    Detects potential registry activity of AnyDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - 'HKLM\SOFTWARE\Clients\Media\AnyDesk'
            - 'HKLM\SYSTEM\CurrentControlSet\Services\AnyDesk'
            - 'HKLM\SOFTWARE\Classes\.anydesk\shell\open\command'
            - 'HKLM\SOFTWARE\Classes\AnyDesk\shell\open\command'
            - 'HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Print\Printers\AnyDesk Printer\*'
            - 'HKLM\DRIVERS\DriverDatabase\DeviceIds\USBPRINT\AnyDesk'
            - 'HKLM\DRIVERS\DriverDatabase\DeviceIds\WSDPRINT\AnyDesk'
            - 'HKLM\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Uninstall\AnyDesk'
    condition: selection
falsepositives:
    - Legitimate use of AnyDesk
level: medium
