title: Potential aria2 RMM Tool Process Activity
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
    - '*\aria2c.exe'
  condition: selection
id: 0bbb7df2-faf4-4551-b701-0a1d10e7f1a6
status: experimental
description: Detects potential processes activity of aria2 RMM tool
author: LOLRMM Project
date: 2024/08/05
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of aria2
level: medium
