title: Potential Aspia RMM Tool Process Activity
id: e99e5977-1f68-48e8-9fd5-5e67840021d1
status: experimental
description: |
    Detects potential processes activity of Aspia RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith: aspia_client.exe
    selection_image:
        Image|endswith: aspia_client.exe
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Aspia
level: medium
