title: Potential Barracuda RMM Tool Network Activity
id: f15d23a0-b1aa-4e74-afe5-4c500848a66d
status: experimental
description: |
    Detects potential network activity of Barracuda RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - *.islonline.net
            - rmm.barracudamsp.com
            - barracudamsp.com
    condition: selection
falsepositives:
    - Legitimate use of Barracuda
level: medium
