title: Potential DeskDay RMM Tool Process Activity
id: 0ab77c50-f1f2-4427-8e18-5c30e7b97351
status: experimental
description: |
    Detects potential processes activity of DeskDay RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith: ultimate_*.exe
    selection_image:
        Image|endswith: ultimate_*.exe
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of DeskDay
level: medium
