title: Potential DeskShare RMM Tool Network Activity
id: 5c3bdd06-0757-4713-8682-a098e436113f
status: experimental
description: |
    Detects potential network activity of DeskShare RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith: user_managed
    condition: selection
falsepositives:
    - Legitimate use of DeskShare
level: medium
