title: Potential ExpanDrive RMM Tool Process Activity
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
    - C:\Users\*\ExpanDrive.exe
    - '*\ExpanDrive.exe'
  condition: selection
id: 063831a9-cbe9-4699-bc06-29cfc716b55f
status: experimental
description: Detects potential processes activity of ExpanDrive RMM tool
author: LOLRMM Project
date: 2024/08/07
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of ExpanDrive
level: medium
