title: Potential ExpanDrive RMM Tool Process Activity
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
    - C:\Users\*\ExpanDrive.exe
    - '*\ExpanDrive.exe'
  condition: selection
id: 93becb5e-c88b-4ef3-8e1b-b51b4661ab18
status: experimental
description: Detects potential processes activity of ExpanDrive RMM tool
author: LOLRMM Project
date: 2024/08/05
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of ExpanDrive
level: medium
