title: Potential FleetDesk.io RMM Tool Process Activity
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
    - fleetdeck_agent_svc.exe
    - fleetdeck_commander_svc.exe
    - fleetdeck_installer.exe
    - fleetdeck_agent.exe
    - fleetdeck_commander_launcher.exe
  condition: selection
id: cdb69ca7-560d-412d-b342-0b7b8c929d58
status: experimental
description: Detects potential processes activity of FleetDesk.io RMM tool
author: LOLRMM Project
date: 2024/08/05
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of FleetDesk.io
level: medium
