title: Potential GoToMyPC RMM Tool Registry Activity
id: beb98caf-9df0-4cc4-a8b8-80bc6a7e7e31
status: experimental
description: |
    Detects potential registry activity of GoToMyPC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - HKEY_LOCAL_MACHINE\WOW6432Node\Citrix\GoToMyPc
            - HKEY_LOCAL_MACHINE\WOW6432Node\Citrix\GoToMyPc\GuestInvite
            - HKEY_CURRENT_USER\SOFTWARE\Citrix\GoToMyPc\FileTransfer\history
            - HKEY_USERS\<SID>\SOFTWARE\Citrix\GoToMyPc\FileTransfer\history
    condition: selection
falsepositives:
    - Legitimate use of GoToMyPC
level: medium
