title: Potential GoToMyPC RMM Tool File Activity
id: 8feba83b-d300-484f-8341-8dd7d798f754
status: experimental
description: |
    Detects potential files activity of GoToMyPC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: %AppData%\GoTo\Logs\goto.log
    condition: selection
falsepositives:
    - Legitimate use of GoToMyPC
level: medium
