title: Potential HopToDesk RMM Tool Network Activity
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname|endswith:
    - signal.hoptodesk.com
    - api.hoptodesk.com
    - turn.hoptodesk.com
    - hoptodesk.com
  condition: selection
status: experimental
description: Detects potential network activity of HopToDesk RMM tool
author: LOLRMM Project
date: 2024/09/19
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of HopToDesk
level: medium
