title: Potential ISL Online RMM Tool Network Activity
id: 8c13bf9e-e7c7-4b8d-a52d-959b916f58f0
status: experimental
description: |
    Detects potential network activity of ISL Online RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - *.islonline.com
            - *.islonline.net
    condition: selection
falsepositives:
    - Legitimate use of ISL Online
level: medium
