title: Potential Kaseya (VSA) RMM Tool Network Activity
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname|endswith:
    - deploy01.kaseya.com
    - '*managedsupport.kaseya.net'
    - '*.kaseya.net'
    - kaseya.com
  condition: selection
id: 92bfd790-5430-4154-b3fd-25aad0220766
status: experimental
description: Detects potential network activity of Kaseya (VSA) RMM tool
author: LOLRMM Project
date: 2024/08/07
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of Kaseya (VSA)
level: medium
