title: Komari RMM Process Activity
id: 4b70ecfc-e18f-435d-b2c6-8cfd68de1619
status: experimental
description: |
    Detects potential processes activity of Komari RMM tool
references:
    - https://github.com/komari-monitor/komari
    - https://www.huntress.com/blog/komari-c2-agent-abuse
author: Daniel Koifman (Koifsec)
date: 2026-05-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - '\komari-windows-386.exe'
            - '\komari-windows-amd64.exe'
            - '\komari-windows-arm64.exe'
            - '\komari-agent.exe'
    selection_image:
       - Image|endswith: 
            - '\komari-windows-386.exe'
            - '\komari-windows-amd64.exe'
            - '\komari-windows-arm64.exe'
            - '\komari-agent.exe'
       - OriginalFileName:
            - 'komari-windows-386.exe'
            - 'komari-windows-amd64.exe'
            - 'komari-windows-arm64.exe'
            - 'komari-agent.exe'
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Komari (unlikely)
level: high
