title: Potential Laplink Everywhere RMM Tool Network Activity
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname|endswith:
    - everywhere.laplink.com
    - le.laplink.com
    - atled.syspectr.com
  condition: selection
id: 59176766-d732-472f-9ee1-db3c096ba760
status: experimental
description: Detects potential network activity of Laplink Everywhere RMM tool
author: LOLRMM Project
date: 2024/08/07
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of Laplink Everywhere
level: medium
