title: Potential Level RMM Tool File Activity
id: 67f248b0-f625-5ec9-98de-5c18f29e50e2
status: experimental
description: |
    Detects potential files activity of Level RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - 'C:\Program Files\Level\level.exe'
            - 'C:\Program Files\Level\osqueryi.exe'
            - 'C:\Program Files\Level\level.log'
    condition: selection
falsepositives:
    - Legitimate use of Level
level: medium
