title: Potential mRemoteNG RMM Tool File Activity
id: 7d5db791-0b23-555d-acfc-6e01cd81795f
status: experimental
description: |
    Detects potential files activity of mRemoteNG RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - 'C:\Users\*\AppData\Roaming\mRemoteNG\mRemoteNG.log'
            - 'C:\Users\*\AppData\Roaming\mRemoteNG\confCons.xml'
            - 'C:\Users\*\AppData\*\mRemoteNG\**10\user.config'
    condition: selection
falsepositives:
    - Legitimate use of mRemoteNG
level: medium
