title: Potential N-Able Advanced Monitoring Agent RMM Tool Network Activity
id: 343b65e8-9f87-4009-9649-fb77db5d1e7f
status: experimental
description: |
    Detects potential network activity of N-Able Advanced Monitoring Agent RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - *remote.management
            - *.logicnow.com
            - *systemmonitor.us
            - *systemmonitor.eu.com
            - *system-monitor.com
            - systemmonitor.us.cdn.cloudflare.net
            - *cloudbackup.management
            - *systemmonitor.co.uk
            - *.n-able.com
            - *.beanywhere.com 
            - *.swi-tc.com
    condition: selection
falsepositives:
    - Legitimate use of N-Able Advanced Monitoring Agent
level: medium
