title: Potential Netop Remote Control (Impero Connect) RMM Tool Network Activity
id: 42ac0f05-030b-4df0-b818-6980374579ab
status: experimental
description: |
    Detects potential network activity of Netop Remote Control (Impero Connect) RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - *.connect.backdrop.cloud
            - *.netop.com
    condition: selection
falsepositives:
    - Legitimate use of Netop Remote Control (Impero Connect)
level: medium
