title: Potential NetSupport Manager RMM Tool Network Activity
id: 8097d92a-5bbf-4dcc-8dc0-28e0726f5ae3
status: experimental
description: |
    Detects potential network activity of NetSupport Manager RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - *.netsupportmanager.com
            - netsupportmanager.com
    condition: selection
falsepositives:
    - Legitimate use of NetSupport Manager
level: medium
