title: Potential OCS inventory RMM Tool Network Activity
id: 6af3935a-ded4-413a-a175-7edea764de78
status: experimental
description: |
    Detects potential network activity of OCS inventory RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - user_managed
            - ocsinventory-ng.org
    condition: selection
falsepositives:
    - Legitimate use of OCS inventory
level: medium
