title: Potential Parsec RMM Tool Process Activity
id: e8d415cf-9326-4f3a-b679-9f37123abd39
status: experimental
description: Detects Potential Parsec RMM Tool Process Activity
references:
    - https://parsec.app/
    - https://www.virustotal.com/gui/file/206cd186aaa431d3975eb30f682b83851ef4f81125d2004f53b681117da23ec6/behavior
author: Luca Di Bartolomeo
date: 2025-03-16
tags:
    - attack.execution
    - attack.t1219
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
        - '*\parsecd.exe'
        - '*\pservice.exe'
        - '*\teams.exe'
    condition: selection
falsepositives:
    - Legitimate Parsec usage
level: medium
