title: Potential Parsec RMM Tool Registry Activity
id: b3b7fad6-2ef8-4212-8b10-e8d1dcf09c9c
status: experimental
description: Detects Potential Parsec RMM Tool Registry Activity
references:
    - https://parsec.app/
    - https://www.virustotal.com/gui/file/206cd186aaa431d3975eb30f682b83851ef4f81125d2004f53b681117da23ec6/behavior
author: Luca Di Bartolomeo
date: 2025-03-16
tags:
    - attack.execution
    - attack.t1219
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains:
            - HKEY_LOCAL_MACHINE\SOFTWARE\Classes\parsec\*
            - HKEY_LOCAL_MACHINE\SOFTWARE\Classes\parsecd\*
            - HKEY_LOCAL_MACHINE\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Uninstall\Parsec\*
            - HKEY_LOCAL_MACHINE\SYSTEM\ControlSet001\Services\parsecvirtualds\*
            - HKEY_LOCAL_MACHINE\SYSTEM\ControlSet001\Services\parsecvusba\*
            - HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\ParsecVUD\*
            - HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\ParsecVDD\*
    condition: selection
falsepositives:
    - Legitimate Parsec usage
level: medium
