title: Potential Parsec RMM Tool Network Activity
id: ee67c1ca-b3d3-4cda-b751-911181fc13a3
status: experimental
description: |
    Detects potential network activity of Parsec RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - parsec.app
            - parsec.gg
            - *.parsec.app
    condition: selection
falsepositives:
    - Legitimate use of Parsec
level: medium
