title: Potential Pulseway RMM Tool Process Activity
id: fddf0980-b359-442b-83f7-65e3e0a165cd
status: experimental
description: |
    Detects potential processes activity of Pulseway RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - PCMonitorManager.exe
            - pcmonitorsrv.exe
    selection_image:
        Image|endswith:
            - PCMonitorManager.exe
            - pcmonitorsrv.exe
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Pulseway
level: medium
