title: Potential RAdmin RMM Tool Registry Activity
id: d713ab8a-cd9e-47b5-b66f-1a436ddd3f0c
status: experimental
description: |
    Detects potential registry activity of RAdmin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains: HKEY_LOCAL_MACHINE\SOFTWARE\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin Security
    condition: selection
falsepositives:
    - Legitimate use of RAdmin
level: medium
