title: Potential RAdmin RMM Tool File Activity
id: ff40caa8-c3b3-59ae-9853-502ebc39e7a8
status: experimental
description: |
    Detects potential files activity of RAdmin RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - 'C:\Windows\SysWOW64\rserver30\Radm_log.htm'
            - 'C:\Windows\System32\rserver30\Radm_log.htm'
            - 'C:\Windows\System32\rserver30\CHATLOGS\*\*.htm'
            - 'C:\Users\*\Documents\ChatLogs\*\*.htm'
    condition: selection
falsepositives:
    - Legitimate use of RAdmin
level: medium
