title: Potential rdpwrap RMM Tool Network Activity
logsource:
  product: windows
  category: network_connection
detection:
  selection:
    DestinationHostname|endswith:
    - user_managed
    - github.com/stascorp/rdpwrap
  condition: selection
id: 572e0b60-49b2-436f-a35c-4d8124455479
status: experimental
description: Detects potential network activity of rdpwrap RMM tool
author: LOLRMM Project
date: 2024/08/07
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of rdpwrap
level: medium
