title: Potential Remcos RMM Tool Process Activity
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
    - remcos*.exe
  condition: selection
id: 18b30604-7121-43a5-9015-dcf63d2e6d0b
status: experimental
description: Detects potential processes activity of Remcos RMM tool
author: LOLRMM Project
date: 2024/08/07
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of Remcos
level: medium
