title: Potential RustDesk RMM Tool File Activity
id: beb04428-e0e1-5207-b941-c75a913865e8
status: experimental
description: |
    Detects potential files activity of RustDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2026-02-03
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: 'C:\Windows\ServiceProfiles\LocalService\AppData\Roaming\RustDesk\*'
    condition: selection
falsepositives:
    - Legitimate use of RustDesk
level: medium
