title: Potential ScreenConnect RMM Tool File Activity
id: fa0f2b6a-8f96-470e-b699-82e4c1bce912
status: experimental
description: |
    Detects potential files activity of ScreenConnect RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - C:\Program Files*\ScreenConnect\App_Data\Session.db
            - C:\Program Files*\ScreenConnect\App_Data\User.xml
            - C:\ProgramData\ScreenConnect Client*\user.config
    condition: selection
falsepositives:
    - Legitimate use of ScreenConnect
level: medium
