title: Potential ScreenConnect RMM Tool File Activity
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|endswith:
    - C:\Program Files*\ScreenConnect\App_Data\Session.db
    - C:\Program Files*\ScreenConnect\App_Data\User.xml
    - C:\ProgramData\ScreenConnect Client*\user.config
  condition: selection
id: 7946b8d4-9321-4ee7-916c-d7de92832038
status: experimental
description: Detects potential files activity of ScreenConnect RMM tool
author: LOLRMM Project
date: 2024/08/05
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of ScreenConnect
level: medium
