title: Potential ScreenConnect RMM Tool Process Activity
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
    - C:\Program Files (x86)\ScreenConnect Client (Random)\ScreenConnect.ClientService.exe
    - Remote Workforce Client.exe
    - '*\*\ScreenConnect.ClientService.exe'
    - '*\*\ScreenConnect.WindowsClient.exe'
    - screenconnect*.exe
    - screenconnect.windowsclient.exe
    - Remote Workforce Client.exe
    - screenconnect*.exe
    - ConnectWiseControl*.exe
    - connectwise*.exe
    - screenconnect.windowsclient.exe
    - screenconnect.clientservice.exe
  condition: selection
id: bc9c7d89-4f55-4a5b-beb2-e4f6ad488fec
status: experimental
description: Detects potential processes activity of ScreenConnect RMM tool
author: LOLRMM Project
date: 2024/08/07
tags:
- attack.execution
- attack.t1219
falsepositives:
- Legitimate use of ScreenConnect
level: medium
