title: Potential ShowMyPC RMM Tool Network Activity
id: eb3a9193-fd54-4d1e-a1c0-f36ee26c651c
status: experimental
description: |
    Detects potential network activity of ShowMyPC RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - *.showmypc.com
            - showmypc.com
    condition: selection
falsepositives:
    - Legitimate use of ShowMyPC
level: medium
