title: Potential SkyFex RMM Tool Process Activity
id: b4da400d-cfa2-48df-b0df-3af0bd829b2a
status: experimental
description: |
    Detects potential processes activity of SkyFex RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - Deskroll.exe
            - DeskRollUA.exe
    selection_image:
        Image|endswith:
            - Deskroll.exe
            - DeskRollUA.exe
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of SkyFex
level: medium
