title: Potential Splashtop RMM Tool Registry Activity
id: 8c1fc139-d98a-4930-b6ea-46508bb60cc5
status: experimental
description: |
    Detects potential registry activity of Splashtop RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - KLM\SOFTWARE\WOW6432Node\Splashtop Inc.\*
            - HKLM\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Uninstall\Splashtop Software Updater
            - HKLM\SYSTEM\CurrentControlSet\Services\SplashtopRemoteService
            - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Splashtop-Splashtop Streamer-Remote Session/Operational
            - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Splashtop-Splashtop Streamer-Status/Operational
            - HKLM\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Uninstall\Splashtop Software Updater\InstallRefCount
            - HKLM\SYSTEM\CurrentControlSet\Control\SafeBoot\Network\SplashtopRemoteService
            - HKU\.DEFAULT\Software\Splashtop Inc.\*
            - HKU\SID\Software\Splashtop Inc.\*
            - HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Print\Printers\Splashtop PDF Remote Printer
            - HKLM\SOFTWARE\WOW6432Node\Splashtop Inc.\Splashtop Remote Server\ClientInfo\*
    condition: selection
falsepositives:
    - Legitimate use of Splashtop
level: medium
