title: Potential Splashtop RMM Tool File Activity
id: 47990f7f-bd65-4bb1-bf63-2614df261554
status: experimental
description: |
    Detects potential files activity of Splashtop RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - C:\windows\System32\winevt\Logs\Splashtop-Splashtop Streamer-Status%4Operational.evtx
            - C:\windows\System32\winevt\Logs\Splashtop-Splashtop Streamer-Remote Session%4Operational.evtx
            - %PROGRAMDATA%\Splashtop\Temp\log\FTCLog.txt
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\log\agent_log.txt
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\log\SPLog.txt
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\log\svcinfo.txt
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\log\sysinfo.txt
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\SRService.exe
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\SRAgent.exe
            - C:\Program Files (x86)\Splashtop\Splashtop Software Updater\SSUAgent.exe
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\SRUtility.exe
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\SRFeature.exe
            - C:\Program Files (x86)\Splashtop\Splashtop Remote\Server\db\SRAgent.sqlite3
    condition: selection
falsepositives:
    - Legitimate use of Splashtop
level: medium
