title: Potential Splashtop RMM Tool Process Activity
id: 68675e5b-9b70-4883-8467-3598cb91279c
status: experimental
description: |
    Detects potential processes activity of Splashtop RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith: strwinclt.exe
    selection_image:
        Image|endswith: strwinclt.exe
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of Splashtop
level: medium
