title: Potential Syncro RMM Tool Network Activity
id: 24964039-9f3a-40ac-a2e0-1a346b3278f7
status: experimental
description: |
    Detects potential network activity of Syncro RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - kabuto.io
            - *.syncromsp.com
            - *.syncroapi.com
            - syncromsp.com
            - servably.com
            - ld.aurelius.host
            - app.kabuto.io 
            - *.kabutoservices.com
            - repairshopr.com
            - kabutoservices.com
            - attachments.servably.com
    condition: selection
falsepositives:
    - Legitimate use of Syncro
level: medium
