title: Potential ToDesk RMM Tool Network Activity
id: 8c9c2180-ab76-47b7-a82a-1c64c451c851
status: experimental
description: |
    Detects potential network activity of ToDesk RMM tool
references:
    - https://github.com/magicsword-io/LOLRMM
author: LOLRMM Project
date: 2025-12-01
tags:
    - attack.execution
    - attack.t1219
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - todesk.com
            - *.todesk.com
            - *.todesk.com
            - todesktop.com
    condition: selection
falsepositives:
    - Legitimate use of ToDesk
level: medium
